package com.example.algorithm;

/**
 * Created by MintQ on 2018/7/16.
 *
 * 《*》编程的灵魂：数据结构 + 算法 = 程序
 *  一、算法概述 - 前言
 *
 * 二、算法分析
 *
 * 三、栈和队列
 *  1、
 *
 * 四、并查集 - 用于解决动态连通性问题，能动态连接两个点，并且判断两个点是否连通。
 *
 * 五、排序
 *  - 待排序的元素需要实现 Java 的 Comparable 接口，该接口有 compareTo() 方法，可以用它来判断两个元素的大小关系。
 *      研究排序算法的成本模型时，计算的是 比较和交换 的次数。
 *     使用辅助函数 less() 和 swap() 来进行比较和交换的操作，使得代码的可读性和可移植性更好。
 *    5.1 - 冒泡排序法
 *    5.2 - 快速排序法
 *    5.3 - 简单选择排序法
 *    5.4 - 堆排序法
 *    5.5 - 直接插入排序法
 *    5.6 - 希尔(shell)排序法
 *    5.7 - 合并排序法
 *
 *    - 排序算法的选择
 *
 * 六、查找
 *
 *
 * 七、其它
 *
 */
public class AlgorithmLearn {
}
